Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.3.59/edc/ATSAME53J19A.PIC
      <edc:AdjustPoint edc:_addr="0x41004006" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x41004008" edc:access="r------------rrrrrrrrrrrrrrrrrrr" edc:cname="PARAM" edc:impl="0x8007FFFF" edc:mclr="00000000000001100000000000000000" edc:nzwidth="0x20" edc:por="00000000000001100000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="NVMP" edc:desc="NVM Pages" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="PSZ" edc:desc="Page Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 bytes" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 bytes" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 bytes" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="64" edc:desc="64 bytes" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="128" edc:desc="128 bytes" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="256" edc:desc="256 bytes" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="512" edc:desc="512 bytes" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="1024" edc:desc="1024 bytes" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="SEE" edc:desc="SmartEEPROM Supported" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="A" edc:desc="163840 bytes" edc:when="(field &amp; 0x1) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="9" edc:desc="147456 bytes" edc:when="(field &amp; 0x1) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="131072 bytes" edc:when="(field &amp; 0x1) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="7" edc:desc="114688 bytes" edc:when="(field &amp; 0x1) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="6" edc:desc="98304 bytes" edc:when="(field &amp; 0x1) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="5" edc:desc="81920 bytes" edc:when="(field &amp; 0x1) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="4" edc:desc="65536 bytes" edc:when="(field &amp; 0x1) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="3" edc:desc="49152 bytes" edc:when="(field &amp; 0x1) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="2" edc:desc="32768 bytes" edc:when="(field &amp; 0x1) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="1" edc:desc="16384 bytes" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="0 bytes" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100400C" edc:access="-----nnnnnnnnnnn" edc:cname="INTENCLR" edc:impl="0x7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="Command Done Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDRE" edc:desc="Address Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:desc="Programming Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:desc="Lock Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECCSE" edc:desc="ECC Single Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECCDE" edc:desc="ECC Dual Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:desc="NVM Error Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Suspended Write Or Erase Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEESFULL" edc:desc="Active SEES Full Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEESOVF" edc:desc="Active SEES Overflow Interrupt Clear" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEEWRC" edc:desc="SEE Write Completed Interrupt Clear" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100400E" edc:access="-----nnnnnnnnnnn" edc:cname="INTENSET" edc:impl="0x7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="Command Done Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDRE" edc:desc="Address Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:desc="Programming Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:desc="Lock Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECCSE" edc:desc="ECC Single Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECCDE" edc:desc="ECC Dual Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:desc="NVM Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Suspended Write Or Erase  Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEESFULL" edc:desc="Active SEES Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEESOVF" edc:desc="Active SEES Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEEWRC" edc:desc="SEE Write Completed Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004010" edc:access="-----nnnnnnnnnnn" edc:cname="INTFLAG" edc:impl="0x7FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DONE" edc:desc="Command Done" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDRE" edc:desc="Address Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGE" edc:desc="Programming Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOCKE" edc:desc="Lock Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECCSE" edc:desc="ECC Single Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECCDE" edc:desc="ECC Dual Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVME" edc:desc="NVM Error" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="Suspended Write Or Erase Operation" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEESFULL" edc:desc="Active SEES Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEESOVF" edc:desc="Active SEES Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SEEWRC" edc:desc="SEE Write Completed" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004012" edc:access="----rrrr--rrrrrr" edc:cname="STATUS" edc:impl="0xF3F" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="READY" edc:desc="Ready to accept a command" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRM" edc:desc="Power Reduction Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LOAD" edc:desc="NVM Page Buffer Active Loading" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUSP" edc:desc="NVM Write Or Erase Operation Is Suspended" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AFIRST" edc:desc="BANKA First" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPDIS" edc:desc="Boot Loader Protection Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BOOTPROT" edc:desc="Boot Loader Protection Size" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="0 kbytes" edc:when="(field &amp; 0xF) == 0xF"/>
              <edc:SFRFieldSemantic edc:cname="8" edc:desc="8 kbytes" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="16" edc:desc="16 kbytes" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="24" edc:desc="24 kbytes" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="32" edc:desc="32 kbytes" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="40" edc:desc="40 kbytes" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="48" edc:desc="48 kbytes" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="56" edc:desc="56 kbytes" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="64" edc:desc="64 kbytes" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="72" edc:desc="72 kbytes" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="80" edc:desc="80 kbytes" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="88" edc:desc="88 kbytes" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="96" edc:desc="96 kbytes" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="104" edc:desc="104 kbytes" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="112" edc:desc="112 kbytes" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="120" edc:desc="120 kbytes" edc:when="(field &amp; 0xF) == 0x0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004014" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADDR" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="NVM Address" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004018" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="RUNLOCK" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="RUNLOCK" edc:desc="Region Un-Lock Bits" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100401C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PBLDATA0" edc:mclr="11111111111111111111111111111111" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Page Buffer Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004020" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PBLDATA1" edc:mclr="11111111111111111111111111111111" edc:nzwidth="0x20" edc:por="11111111111111111111111111111111" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Page Buffer Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41004024" edc:access="rrrr----rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ECCERR" edc:impl="0xF0FFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="NVMCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Error Address" edc:nzwidth="0x18"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TYPEL" edc:desc="Low Double-Word Error Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="None" edc:desc="No Error Detected Since Last Read" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="Single" edc:desc="At Least One Single Error Detected Since last Read" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="Dual" edc:desc="At Least One Dual Error Detected Since Last Read" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TYPEH" edc:desc="High Double-Word Error Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="None" edc:desc="No Error Detected Since Last Read" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="Single" edc:desc="At Least One Single Error Detected Since last Read" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="Dual" edc:desc="At Least One Dual Error Detected Since Last Read" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
