Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.3.59/edc/ATSAME53J19A.PIC
      <edc:SFRDef edc:_addr="0x41008090" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GROUP1OUT" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="OUT" edc:desc="PORT Data Output Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41008094" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GROUP1OUTCLR" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="OUTCLR" edc:desc="PORT Data Output Value Clear" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x41008098" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GROUP1OUTSET" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="OUTSET" edc:desc="PORT Data Output Value Set" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100809C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GROUP1OUTTGL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="OUTTGL" edc:desc="PORT Data Output Value Toggle" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410080A0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="GROUP1IN" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="IN" edc:desc="PORT Data Input Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410080A4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GROUP1CTRL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="SAMPLING" edc:desc="Input Sampling Mode" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410080A8" edc:access="ww-wwwww-w---wwwwwwwwwwwwwwwwwww" edc:cname="GROUP1WRCONFIG" edc:impl="0xDF47FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PINMASK" edc:desc="Pin Mask for Multiple Pin Configuration" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="PMUXEN" edc:desc="Peripheral Multiplexer Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INEN" edc:desc="Input Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PULLEN" edc:desc="Pull Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="DRVSTR" edc:desc="Output Driver Strength Selection" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PMUX" edc:desc="Peripheral Multiplexing" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="WRPMUX" edc:desc="Write PMUX" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WRPINCFG" edc:desc="Write PINCFG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HWSEL" edc:desc="Half-Word Select" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410080AC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GROUP1EVCTRL" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PID0" edc:desc="PORT Event Pin Identifier 0" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="EVACT0" edc:desc="PORT Event Action 0" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="OUT" edc:desc="Event output to pin" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set output register of pin on event" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLR" edc:desc="Clear output register of pin on event" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="TGL" edc:desc="Toggle output register of pin on event" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PORTEI0" edc:desc="PORT Event Input Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID1" edc:desc="PORT Event Pin Identifier 1" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="EVACT1" edc:desc="PORT Event Action 1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PORTEI1" edc:desc="PORT Event Input Enable 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID2" edc:desc="PORT Event Pin Identifier 2" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="EVACT2" edc:desc="PORT Event Action 2" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PORTEI2" edc:desc="PORT Event Input Enable 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PID3" edc:desc="PORT Event Pin Identifier 3" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="EVACT3" edc:desc="PORT Event Action 3" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PORTEI3" edc:desc="PORT Event Input Enable 3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410080B0" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX0" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410080B1" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x410080B2" edc:access="nnnnnnnn" edc:cname="GROUP1PMUX2" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PORT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:desc="Peripheral Multiplexing for Even-Numbered Pin" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
