Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/3.3.59/edc/ATSAME53J19A.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PB13" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X27" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y27" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC4"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F" ltx:memberofperipheral="TCC3"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="SDWP" edc:ppsfunction="I" ltx:memberofperipheral="SDHC0"/>
      <edc:VirtualPin edc:name="MCK1" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="IO7" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB14" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X28" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y28" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC5"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F" ltx:memberofperipheral="TCC4"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="DATA8" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="GMDC" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN9" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB15" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X29" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y29" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC5"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F" ltx:memberofperipheral="TCC4"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="DATA9" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="GMDIO" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN10" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC2"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="G" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="SDCD" edc:ppsfunction="I" ltx:memberofperipheral="SDHC0"/>
      <edc:VirtualPin edc:name="DEN1" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="GRX1" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="M" ltx:memberofperipheral="AC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA13" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT13" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC2"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="G" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="SDWP" edc:ppsfunction="I" ltx:memberofperipheral="SDHC0"/>
      <edc:VirtualPin edc:name="DEN2" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="GRX0" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="M" ltx:memberofperipheral="AC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="G" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="CLK" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="GTXCK" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="XIN0" edc:ppsfunction="XIN0" ltx:memberofperipheral="OSCCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM2"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM4"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="G" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="GRXER" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="XOUT0" edc:ppsfunction="XOUT0" ltx:memberofperipheral="OSCCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X10" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y10" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC2"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="DATA0" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="GCRS" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="GRXDV" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="IO2" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X11" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y11" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC2"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="DATA1" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="GTXEN" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="IO3" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X12" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y12" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="DATA2" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="GTX0" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="M" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X13" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y13" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC3"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="DATA3" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="GTX1" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="M" ltx:memberofperipheral="AC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB16" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F" ltx:memberofperipheral="TCC3"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="SCK0" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="IO2" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN11" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB17" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F" ltx:memberofperipheral="TCC3"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="MCK0" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="IO3" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="OUT3" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X14" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y14" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="FS0" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="DATA4" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="GMDC" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X15" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y15" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="SDO" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="DATA5" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="GMDIO" edc:ppsfunction="L" ltx:memberofperipheral="GMAC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X16" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y16" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC4"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="SDI" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="DATA6" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="IN6" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA23" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X17" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y17" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC4"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F" ltx:memberofperipheral="TCC1"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="G" ltx:memberofperipheral="TCC0"/>
      <edc:VirtualPin edc:name="SOF_1KHZ" edc:ppsfunction="H" ltx:memberofperipheral="USB"/>
      <edc:VirtualPin edc:name="FS1" edc:ppsfunction="J" ltx:memberofperipheral="I2S"/>
      <edc:VirtualPin edc:name="DATA7" edc:ppsfunction="K" ltx:memberofperipheral="PCC"/>
      <edc:VirtualPin edc:name="IN7" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT8" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E" ltx:memberofperipheral="TC5"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="QDI0" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="DM" edc:ppsfunction="H" ltx:memberofperipheral="USB"/>
      <edc:VirtualPin edc:name="IN8" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT9" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM3"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E" ltx:memberofperipheral="TC5"/>
      <edc:VirtualPin edc:name="QDI1" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="DP" edc:ppsfunction="H" ltx:memberofperipheral="USB"/>
      <edc:VirtualPin edc:name="OUT2" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB22" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="QDI2" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="SOF_1KHZ" edc:ppsfunction="H" ltx:memberofperipheral="USB"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="XIN1" edc:ppsfunction="XIN1" ltx:memberofperipheral="OSCCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB23" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM5"/>
      <edc:VirtualPin edc:name="QDI0" edc:ppsfunction="G" ltx:memberofperipheral="PDEC"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="XOUT1" edc:ppsfunction="XOUT1" ltx:memberofperipheral="OSCCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA27" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X18" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y18" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RESET_N" edc:ppsfunction="default" ltx:memberofperipheral="PM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA30" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="X19" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="Y19" edc:ppsfunction="B" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="M" ltx:memberofperipheral="GCLK"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA31" edc:ppsfunction="default" ltx:memberofperipheral="PORT"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A" ltx:memberofperipheral="EIC"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D" ltx:memberofperipheral="SERCOM1"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F" ltx:memberofperipheral="TCC2"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="N" ltx:memberofperipheral="CCL"/>
    </edc:Pin>
